#### Dev Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/rcomarceli-tutorial/dev-resume/runs/run-tNKPCkFs1XdVoydx

Waiting for the plan to start...

Terraform v1.3.8
on linux_amd64
Initializing plugins and modules...
random_pet.website_bucket_name: Refreshing state... [id=dev-resume-website-directly-live-lemming]
random_pet.lambda_bucket_name: Refreshing state... [id=dev-resume-lambda-inherently-magical-bluegill]
module.backend.data.archive_file.lambda_code: Refreshing...
module.backend.data.archive_file.lambda_code: Refresh complete after 0s [id=6b4c1c7a6d7cc540760ae5292e204aa4e3af7e26]
module.dns.cloudflare_zone_settings_override.application: Refreshing state... [id=733fd37e491cff26d1ef7600717eca24]
module.backend.aws_apigatewayv2_api.lambda: Refreshing state... [id=gouieeb2a0]
module.backend.aws_iam_role.lambda_exec: Refreshing state... [id=dev_resume_lambda_iam_role]
module.frontend.aws_s3_bucket.application: Refreshing state... [id=dev-resume-website-directly-live-lemming]
module.backend.aws_dynamodb_table.update_visitor_counter: Refreshing state... [id=dev_resume_db]
module.backend.aws_s3_bucket.lambda_bucket: Refreshing state... [id=dev-resume-lambda-inherently-magical-bluegill]
module.backend.aws_iam_policy.database_access: Refreshing state... [id=arn:aws:iam::681163022059:policy/dev_resume_lambda_Iam_Policy]
module.backend.aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/vendedlogs/dev_resume_api]
module.backend.aws_apigatewayv2_stage.lambda: Refreshing state... [id=dev_v1]
module.backend.aws_s3_bucket_acl.lambda_bucket: Refreshing state... [id=dev-resume-lambda-inherently-magical-bluegill,private]
module.backend.aws_s3_object.lambda_code: Refreshing state... [id=lambda_code.zip]
module.frontend.aws_s3_object.index: Refreshing state... [id=index.html]
module.frontend.data.aws_iam_policy_document.application: Refreshing...
module.frontend.aws_s3_bucket_website_configuration.application: Refreshing state... [id=dev-resume-website-directly-live-lemming]
module.frontend.aws_s3_object.assets["pythonImage-90e518e6.png"]: Refreshing state... [id=assets/pythonImage-90e518e6.png]
module.frontend.aws_s3_object.assets["secplus-cd014414.png"]: Refreshing state... [id=assets/secplus-cd014414.png]
module.frontend.aws_s3_object.assets["discordImage-71e219bc.png"]: Refreshing state... [id=assets/discordImage-71e219bc.png]
module.frontend.aws_s3_object.assets["aws-ccp-db3a431b.png"]: Refreshing state... [id=assets/aws-ccp-db3a431b.png]
module.frontend.data.aws_iam_policy_document.application: Refresh complete after 0s [id=3699393706]
module.frontend.aws_s3_object.assets["ccna-e367a946.png"]: Refreshing state... [id=assets/ccna-e367a946.png]
module.frontend.aws_s3_object.assets["resume-4bd2f740.pdf"]: Refreshing state... [id=assets/resume-4bd2f740.pdf]
module.frontend.aws_s3_object.assets["watchguardBadge-a50068d3.png"]: Refreshing state... [id=assets/watchguardBadge-a50068d3.png]
module.frontend.aws_s3_object.assets["index-7949145f.css"]: Refreshing state... [id=assets/index-7949145f.css]
module.frontend.aws_s3_object.assets["jlpt-5334537d.png"]: Refreshing state... [id=assets/jlpt-5334537d.png]
module.frontend.aws_s3_object.assets["apple-touch-icon-e413d60c.png"]: Refreshing state... [id=assets/apple-touch-icon-e413d60c.png]
module.frontend.aws_s3_object.assets["vbscriptImage-957c4295.png"]: Refreshing state... [id=assets/vbscriptImage-957c4295.png]
module.frontend.aws_s3_object.assets["resumeImage-624321b9.png"]: Refreshing state... [id=assets/resumeImage-624321b9.png]
module.frontend.aws_s3_object.assets["index-17fe6429.js"]: Refreshing state... [id=assets/index-17fe6429.js]
module.frontend.aws_s3_bucket_policy.application: Refreshing state... [id=dev-resume-website-directly-live-lemming]
module.backend.cloudflare_worker_script.api_reverseproxy: Refreshing state... [id=terraform-api-reverseproxy-dev]
module.dns.cloudflare_record.site_cname: Refreshing state... [id=b1c0cc4570fad677bb7bc4dd226e69c4]
module.dns.cloudflare_worker_script.change_header: Refreshing state... [id=terraform-change-resume-host-header-dev]
module.backend.aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=dev_resume_lambda_iam_role-20230213214552535700000001]
module.backend.aws_iam_role_policy_attachment.database_access: Refreshing state... [id=dev_resume_lambda_iam_role-20230213214604788700000002]
module.backend.aws_lambda_function.update_visitor_counter: Refreshing state... [id=dev_updatevisitorcounter]
module.backend.aws_lambda_permission.api_gw: Refreshing state... [id=dev_resume_lambda_permission]
module.backend.aws_apigatewayv2_integration.update_visitor_counter: Refreshing state... [id=fd9kya9]
module.backend.aws_cloudwatch_log_group.update_visitor_counter: Refreshing state... [id=/aws/lambda/dev_updatevisitorcounter]
module.backend.aws_apigatewayv2_route.update_visitor_counter: Refreshing state... [id=barv0j0]
module.backend.cloudflare_worker_route.api_reverseproxy: Refreshing state... [id=10a3129f79bc4ca3ae30cfc67c76136b]
module.dns.cloudflare_worker_route.change_header: Refreshing state... [id=7f7ed78d196246399fde1189cc9350d4]
module.dns.cloudflare_zone_settings_override.application: Drift detected (update)
module.frontend.aws_s3_object.assets["index-17fe6429.js"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.frontend.aws_s3_object.assets["apple-touch-icon-d4cb6ac4.png"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = "private"
      + bucket                 = "dev-resume-website-directly-live-lemming"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "9bdee96588d1738ffdead11f53a1b5db"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/apple-touch-icon-d4cb6ac4.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = ".terraform/modules/frontend/frontend/src/dist/assets/apple-touch-icon-d4cb6ac4.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_object.assets["apple-touch-icon-e413d60c.png"] will be destroyed
  # (because key ["apple-touch-icon-e413d60c.png"] is not in for_each map)
  - resource "aws_s3_object" "assets" {
      - acl                    = "private" -> null
      - bucket                 = "dev-resume-website-directly-live-lemming" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "9b96447c3c88c83c760f7fb3e172d81c" -> null
      - force_destroy          = false -> null
      - id                     = "assets/apple-touch-icon-e413d60c.png" -> null
      - key                    = "assets/apple-touch-icon-e413d60c.png" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = ".terraform/modules/frontend/frontend/src/dist/assets/apple-touch-icon-e413d60c.png" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Environment" = "dev"
          - "Terraform"   = "true"
        } -> null
    }

  # module.frontend.aws_s3_object.assets["index-17fe6429.js"] will be destroyed
  # (because key ["index-17fe6429.js"] is not in for_each map)
  - resource "aws_s3_object" "assets" {
      - acl                    = "private" -> null
      - bucket                 = "dev-resume-website-directly-live-lemming" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "72b4ccf47422d10cef35791ac6a62cd6" -> null
      - force_destroy          = false -> null
      - id                     = "assets/index-17fe6429.js" -> null
      - key                    = "assets/index-17fe6429.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = ".terraform/modules/frontend/frontend/src/dist/assets/index-17fe6429.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Environment" = "dev"
          - "Terraform"   = "true"
        } -> null
    }

  # module.frontend.aws_s3_object.assets["index-4ffdfe41.js"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = "private"
      + bucket                 = "dev-resume-website-directly-live-lemming"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "72b4ccf47422d10cef35791ac6a62cd6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/index-4ffdfe41.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = ".terraform/modules/frontend/frontend/src/dist/assets/index-4ffdfe41.js"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_object.assets["index-6ee8f45d.css"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = "private"
      + bucket                 = "dev-resume-website-directly-live-lemming"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css"
      + etag                   = "f7e423239601e9304bf104cf782d2a7a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/index-6ee8f45d.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = ".terraform/modules/frontend/frontend/src/dist/assets/index-6ee8f45d.css"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_object.assets["index-7949145f.css"] will be destroyed
  # (because key ["index-7949145f.css"] is not in for_each map)
  - resource "aws_s3_object" "assets" {
      - acl                    = "private" -> null
      - bucket                 = "dev-resume-website-directly-live-lemming" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css" -> null
      - etag                   = "185ecd79ca6e804182c13e5292d2759a" -> null
      - force_destroy          = false -> null
      - id                     = "assets/index-7949145f.css" -> null
      - key                    = "assets/index-7949145f.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = ".terraform/modules/frontend/frontend/src/dist/assets/index-7949145f.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Environment" = "dev"
          - "Terraform"   = "true"
        } -> null
    }

  # module.frontend.aws_s3_object.index will be updated in-place
  ~ resource "aws_s3_object" "index" {
      ~ etag                   = "df8f39fe71895ff91a11494fd2f7869b" -> "539cac246ed62f7f638556d69a8f10e3"
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

```
</details>
*Pushed by: @Rcomarceli, Action: `pull_request`*